[
{"Page_ID": "06ed72ef-29a4-11ed-954e-04d9f52184ba", "Title": "Kennesaw State University in Georgia", "url": "https://www.kennesaw.edu/", "Body": "Kennesaw State University in Georgia Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Play Pause FIND YOUR WINGS Discover your passion and purpose at KSU. Find Your Degree See the Cost Apply to KSU Find Your Degree KSU offers 180 bachelor's master's doctoral degrees and programs. Search below to find your degree or view Certificates and Minor programs. Search by Degree Type Undergraduate Graduate Online Apply by KSU Priority Deadline Kennesaw State's Fall 2023 undergraduate application is now open. Apply by the Priority Deadline Oct. 31 2022 to get early access to housing and orientation sign ups Be one of the first to join KSU's Class of 2027. Apply Today Why Choose KSU Awesome Location Only 15 miles from the excitement of Atlanta with even more excitement locally. Over 180 Programs A leader in innovative teaching and learning KSU offers over 180 undergraduate graduate and doctoral degrees and programs R2 University Kennesaw State is a Carnegie designated doctoral research institution R2 placing it among an elite group of only 6 percent of U.S. colleges. How much does it cost KSU is dedicated to ensuring that you know what to expect financially and helping you identify potential sources of financial aid. COST FOR BACHELOR'S COST FOR MASTER'S DOCTORATE How do I apply Apply for Bachelor's Apply for Master's Doctorate University NewsSee all news Kennesaw State faculty research among most influential in leading journal's historyKennesaw State honors student researchers in annual Birla Carbon Scholars SymposiumKennesaw State researcher receives grant to study pollution effects in birds3D Printing Ecosystem transforms education at Kennesaw State University Upcoming EventsSee all events FIND YOUR INTEREST At KSU our colleges are dedicated to our students. Our faculty and staff are student centered and focused on providing you with a rewarding learning experience. Architecture Construction Management Arts Business Computing Software Engineering Cybersecurity Education Engineering Engineering Technology Graduate Honors Humanities Social Sciences Health Human Services Professional Education Science Mathematics ARE YOU READY TO FIND YOUR WINGS REQUEST INFO VISIT APPLY Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "073fdd75-29a4-11ed-95bb-04d9f52184ba", "Title": "College of Computing and Software Engineering", "url": "https://ccse.kennesaw.edu/", "Body": "College of Computing and Software Engineering Oops You don't have Javascript enabled. Some features on this site might not work correctly. Kennesaw State University College of Computing and Software Engineering Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU About KSU Academics Admissions Student Life Research Alumni Athletics HomeAbout CCSEWelcome From the DeanOverviewOffice of the Dean Contact InformationDegrees Majors and ProgramsDepartments and SchoolsData Science and AnalyticsComputer ScienceInformation TechnologySoftware Engineering and Game DevelopmentResearchCCSE Research CentersFaculty ResearchStudent ResearchLabsAcademic AdvisingEvents2022 Fall HackathonC DayCurrent EventsPrevious HackathonsNewsShare Your SuccessFaculty Staff Student ResourcesStudent ResourcesShared Governance Faculty Faculty ResourcesCo Ops Internships and JobsCCSE AlumniInterim FeedbackJob OpportunitiesShare Your Success Search KSU Kennesaw State student will use technology to create magic during Disney internship An experience in Disney World three years ago shaped that dream and changed the trajectory of her life. Kennesaw State student selected for highly competitive State Department fellowship In the 2022 cohort Uduka is one of eight undergraduate students selected for the fellowship. Kennesaw State student turns equine passion into impactful research project. KSU senior Lauren Christian combined her passion for horses with her research of health data. Kennesaw State student presenting research to Capitol Hill officials Kennesaw State University graduate student Nathaniel Jones will present his undergraduate research on the federal Pell Grant program to members of Congress their staff members and other officials this week at the annual Posters on the Hill event. HomeAbout CCSEWelcome From the DeanOverviewOffice of the Dean Contact InformationDegrees Majors and ProgramsDepartments and SchoolsData Science and AnalyticsComputer ScienceInformation TechnologySoftware Engineering and Game DevelopmentResearchCCSE Research CentersFaculty ResearchStudent ResearchLabsAcademic AdvisingEvents2022 Fall HackathonC DayCurrent EventsPrevious HackathonsNewsShare Your SuccessFaculty Staff Student ResourcesStudent ResourcesShared Governance Faculty Faculty ResourcesCo Ops Internships and JobsCCSE AlumniInterim FeedbackJob OpportunitiesShare Your Success Connect With Us Computing and Information Technology at KSU Kennesaw State University's College of Computing and Software Engineering is one of the best in the country with each of its degree programs being recognized nationally. We offer both undergraduate and graduate degrees in Computer Science Information Technology Software Engineering Computer Game Design and Development and Data Science and Analytics. Welcome our New Chairs Information Technology Information Technology Chair Dr. Shaoen Wu has a Ph.D. from Auburn University. He is currently a State Farm Endowed professor of Cybersecurity at the school of Information Technology at Illinois State University. Dr. Wu is a Founding Director Center for Cybersecurity Research and Education. Software Engineering and Game Development Software Engineering and Game Development Chair Dr. George Markowsky received his Ph.D. in Mathematics from Harvard University. He was a Chair and Professor of Computer Science at Missouri University of Science Technology. Before joining Missouri S T he was the founding Chair of the Computer Science Department at the University of Maine where he served as Chair for many years. Computer Science Chair Computer Science Chair Dr. Yong Pei received his Ph.D. in Electrical Engineering from Rensselaer Polytechnic Institute Troy NY and currently holds the Endowed Chair of LexisNexis Ohio Eminent Scholar for Advanced Data Management and Analysis at Wright State University. He served as the Graduate Program Director of Ph.D. in Computer Science and in the Engineering program. Students Academic Advising Student Resources Student Clubs Support CCSE Partner With CCSE Giving to CCSE Faculty and Staff Giving CCSE Alumni Faculty Expertise Faculty Research Research Centers K 12 Outreach Upcoming Events More Events Latest News More News Kennesaw State student turns equine passion into impactful research project KSU student to present research to Capitol Hill officials Students to present research at Georgia Capitol Summer Course Brings Disney Magic Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "07cb83b7-29a4-11ed-9ce4-04d9f52184ba", "Title": "Counseling and Psychological Services", "url": "https://counseling.kennesaw.edu/index.php", "Body": "Counseling and Psychological Services Oops You don't have Javascript enabled. Some features on this site might not work correctly. Kennesaw State University Counseling and Psychological Services Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU About KSU Academics Admissions Student Life Research Alumni Athletics HomeServicesEmergencyWorkshops and ProgramsStudent Advisory BoardApps and Self Help ResourcesClinical Training ProgramDoctoral Internship ProgramContinuing EducationContact UsHours and LocationsMeet our StaffStudent Affairs Search KSU HomeServicesEmergencyWorkshops and ProgramsStudent Advisory BoardApps and Self Help ResourcesClinical Training ProgramDoctoral Internship ProgramContinuing EducationContact UsHours and LocationsMeet our StaffStudent Affairs Connect With Us Welcome to Counseling and Psychological Services Counseling and Psychological Services supports the academic mission of Kennesaw State University by enhancing students educational career personal and interpersonal development. We provide a wide range of service including psychoeducational workshops aimed at helping students develop skills for managing the stress of college group counseling focused on helping student better manage emotions and navigate their relationships individual counseling for a wide range of mental wellness concerns as well as psychiatric medication evaluation and treatment. Wellbeing@KSU Need help with anxiety depression stress relationship problems worries grief loss coping skills or a check in between sessions For immediate MENTAL HEALTH SUPPORT 24 7 call 833 874 0013. Initial Consultation Let's Hoot is your chance to meet with a counselor to develop a plan and learn about the wide variety of supportive services that we offer. Our Services Our clinical services include consultation short term counseling i.e. group individual couples psychiatry and case management. Wellness Peer Mentoring Wellness Peer Mentors are students who are trained on a wide variety of helping skills. They are prepared to coach students who are struggling with some of the top impediments to mental health and wellbeing on campus. Upcoming Events Skillshops and more View More Queering Love LanguagesSep1Interested in learning more about the LGBTQ community and LGBTQ culture Join us for this series of ...3 00 pmAcademic Learning Center Room 2105Queering Love LanguagesThursday September 1 20223 00 pmAcademic Learning Center Room 2105So You Think You Can't PASS ProcrastinationSep2Successful students rely on a toolbox of strategies techniques and supports to help them achieve th...2 00 pmOnlineSo You Think You Can't PASS ProcrastinationFriday September 2 20222 00 pmOnlineManaging Anxiety and Depression workshopSep6Our Managing Anxiety and Depression virtual workshop will be an educational experience with the oppo...2 00 pmOnlineManaging Anxiety and Depression workshopTuesday September 6 20222 00 pmOnline For additional information contact us at counseling@kennesaw.edu 470 578 6600 Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "['counseling@kennesaw.edu']"},
{"Page_ID": "07e2b68d-29a4-11ed-90fb-04d9f52184ba", "Title": "Application Information - Kennesaw State University", "url": "https://www.kennesaw.edu/apply.php", "Body": "Application Information Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Apply to KSU Kennesaw State University Application Information Undergraduate Application Graduate Application Professional Education Undergraduate Application Our number one priority at KSU is you and your success. We want your application process to be simple and exciting no matter your application type. We re excited that you ve chosen KSU as your academic doorway to reach your future potential and purpose. We are here to help you during the entire application process. Welcome future KSU Owls apply learn more Graduate Application KSU gives you the tools needed to advance in your career and find your path to success. We support our graduates in returning to academia to become professionals that excel in their field of interest. Our application process is straightforward and simple to save you time and effort. Get started on your graduate application today to start enhancing your skills as a KSU Owl. apply learn more Professional Education at KSU It s Your Profession. Soar Higher. It s time to start investing in yourself. Apply for a professional program at Kennesaw State to advance and skills to reach your professional and career goals faster. Get ahead with professional certificates corporate learning opportunities community programs and more apply learn more Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "08535931-29a4-11ed-bf78-04d9f52184ba", "Title": "Online Students - Kennesaw State University", "url": "https://www.kennesaw.edu/online-students/", "Body": "Online Students Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Online Students Kennesaw State University Online Students D2L Brightspace KSUMail Owl Express DegreeWorks Handshake Owl Life Course Evaluations Online Learning Support Academic Advising Library University NewsSee all news Kennesaw State faculty research among most influential in leading journal's historyKennesaw State honors student researchers in annual Birla Carbon Scholars SymposiumKennesaw State researcher receives grant to study pollution effects in birds3D Printing Ecosystem transforms education at Kennesaw State University Upcoming EventsSee all events Resources Computing Resources University Information Technology Services Service Portal Academic Resources Advising Global Education Learn Online Library Handbooks Owl Advising Registrar Testing Center Writing Center Finances Bursar's Office Financial Aid Financial Management Tuition and Fees International Community Global Education Global Village Maya Project Latino Program Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Dean of Students Office of the Dean of Students Student Advocacy Student Conduct Academic Integrity Disability Services CARE Services Health Wellbeing Wellbeing@KSU Student Health Services Counseling Psychological Services Sports Recreation Wellness Center for Young Adult Addiction Recovery Community Leadership African American Male Initiative Diversity Inclusion Cultural Awareness Resource Center LGBTQ Resource Center Military Community Student Leadership Services Student Government Association Women's Resource Center Need Help Get Help. With resources from academic assistance to health and emergencies these resources will allow you to get the immediate help and assistance you need at KSU. See Something Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20 30 minutes north of Atlanta GA. No matter where you choose to visit us we hope you ll love Kennesaw State University as much as we do. Student Success Possessing computer skills and feeling comfortable online does not necessarily ensure your success in an online course. A common theme in online courses is self discipline and persistence. At Kennesaw State we are committed to helping our online students achieving their academic best. Online Student Success Frequently Asked Questions What are the benefits of online learning Online learning provides considerable freedom allowing students to often choose when and where they'll participate in class activities. Save time and money spent commuting to a campus Continue working at your current job while you are taking classes Attend your class from anywhere as long as you have a high speed Internet connection Learn at your own pace and study at your convenience Learn new technologies Interact on equal footing Students will have the same kinds of deadlines and structured responsibilities of a face to face class. In other words flexibility must be balanced by responsibility. Like a face to face course online courses require assignments be completed by due dates your attendance via logins to your course involvement in online discussions and sometimes group collaboration. Most students enjoy the active learning that online classes involve. What are the challenges of online learning Self motivation and discipline are required to succeed in distance learning courses. For many distance learning offers access to education not previously available. It also provides a solution to flexibility needs work and travel responsibilities and family challenges. A successful experience in distance learning requires a basic familiarity with technology. Resources are available for students through University Information Technology Services for those interested in distance learning but in need of a technology refresher. It is also strongly recommended that students have ready access to a computer or laptop with a high speed Internet access such as DSL or cable broadband. Online courses will require students to download and access course materials. Online learning success depends on preparation motivation dedication and planning. What equipment and technology will I need to be successful at online learning Online learners will need a computer Internet access basic software such as Microsoft Office Suite Windows Media Player Quicktime movie player anti virus protection and a compatible browser and auxiliary equipment such as a webcam and microphone headset for video based communication . Of course technology needs will vary by course. But this list applies to the majority of courses. Computer Online Learners will need reliable access to a desktop or laptop computer that has adequate memory and processing capabilities for large file downloads video players and synchronous meeting applications. Auxiliary Equipment The Digital Learning Innovations team also strongly recommends a WebCam and Headset for video based communication. Many newer laptop or monitor set ups are pre equipped. These items may be required by faculty on a course by course basis. Internet Access Online courses at KSU use the web to deliver courses at a distance. So to learn in an online course smoothly you need a high speed Internet connection such as DSL Broadband etc . This is especially important to the online learning experience. Software While this will vary by course you will need a recent version of the Microsoft Office Suite. Access to MS Word MS PowerPoint and MS Excel are expected and necessary for viewing course material or completing assignments. Additional requirements include anti virus protection Windows Media Player QuickTime movie player and a compatible browser. Visit UITS Training for additional information on software training compatibility and available downloads. HAVE MORE QUESTIONS FIND YOUR INTEREST At KSU our colleges are dedicated to our students. Our faculty and staff are student centered and focused on providing you with a rewarding learning experience. Architecture Construction Management Arts Business Computing Software Engineering Cybersecurity Education Engineering Engineering Technology Graduate Honors Humanities Social Sciences Health Human Services Professional Education Science Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "087c8e76-29a4-11ed-af0c-04d9f52184ba", "Title": "University Calendars - Kennesaw State University", "url": "https://www.kennesaw.edu/calendar.php", "Body": "University Calendars Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar University Calendars Kennesaw State University University Calendars Event Calendar Academic Calendar Athletics Calendar KSU Event CalendarSee all events KSU Fall 2022 Academic Calendar See all academic calendars FIRST FLIGHT Registration See Time Ticket Matrix for Details NOTE eCore Dates May Differ See Link at Bottom Begins 8 00 a.m. March 11 2022 F August 10 2022 W ending at 11 45 p.m. First Day of Classes Jul 25 M Registration Drop Add Begins 8 00 a.m. Ends 11 45 p.m. eCore Dates May Differ See Below Link Jul 25 M Holidays Breaks N A Payment Deadline 4 00 p.m. includes eCore Aug 19 F Financial Aid Disbursement Aug 26 F Deletion of Courses for Nonpayment 2 p.m. includes eCore Aug 29 M Last Day to Withdraw Without Academic Penalty 11 45 p.m. Jul 29 F Last Day to Withdraw with a WF Aug 2 Tu Last Day of Classes Aug 4 Th Final Exams Aug 5 F Final Grades Due by Noon Aug 8 M Graduation Dec 13 Tu Dec 14 W 7 WEEK I Registration See Time Ticket Matrix for Details NOTE eCore Dates May Differ See Link at Bottom Begins 8 00 a.m. March 11 2022 F August 10 2022 W ending at 11 45 p.m. First Day of Classes Aug 15 M Registration Drop Add Begins 8 00 a.m. Ends 11 45 p.m. eCore Dates May Differ See Below Link Aug 15 M 19 F Holidays Breaks Sep 5 M Payment Deadline 4 00 p.m. includes eCore Aug 19 F Financial Aid Disbursement Aug 26 F Deletion of Courses for Nonpayment 2 p.m. includes eCore Aug 29 M Last Day to Withdraw Without Academic Penalty 11 45 p.m. Sep 8 Th Last Day to Withdraw with a WF Sep 27 Tu Last Day of Classes Oct 3 M Final Exams Oct 4 Tu Oct 5 W Final Grades Due by Noon Oct 7 F Graduation Dec 13 Tu Dec 14 W 15 WEEK Registration See Time Ticket Matrix for Details NOTE eCore Dates May Differ See Link at Bottom Begins 8 00 a.m. March 11 2022 F August 10 2022 W ending at 11 45 p.m. First Day of Classes Aug 15 M Registration Drop Add Begins 8 00 a.m. Ends 11 45 p.m. eCore Dates May Differ See Below Link Aug 15 M 19 F Holidays Breaks Sep 5 M Nov 20 Su 26 S Payment Deadline 4 00 p.m. includes eCore Aug 19 F Financial Aid Disbursement Aug 26 F Deletion of Courses for Nonpayment 2 p.m. includes eCore Aug 29 M Last Day to Withdraw Without Academic Penalty 11 45 p.m. Oct 11 Tu Last Day to Withdraw with a WF Nov 29 Tu Last Day of Classes Dec 5 M Final Exams Dec 6 Tu Dec 12 M Final Grades Due by Noon Dec 15 Th Graduation Dec 13 Tu Dec 14 W 7 WEEK II Registration See Time Ticket Matrix for Details NOTE eCore Dates May Differ See Link at Bottom Begins 8 00 a.m. March 11 2022 F August 10 2022 W ending at 11 45 p.m. First Day of Classes Oct 11 Tu Registration Drop Add Begins 8 00 a.m. Ends 11 45 p.m. eCore Dates May Differ See Below Link Aug 15 M 19 F Oct 4 Tu 12 W Holidays Breaks Nov 20 Su 26 S Payment Deadline 4 00 p.m. includes eCore Aug 19 F for registrations on before Aug 19 Oct 14 F for registrations in October Financial Aid Disbursement Aug 26 F for registrations before Aug 20 Oct 13 Th for registrations in October Deletion of Courses for Nonpayment 2 p.m. includes eCore Aug 29 M for registrations before Aug 20 Oct 17 M for registrations in October Last Day to Withdraw Without Academic Penalty 11 45 p.m. Nov 3 Th Last Day to Withdraw with a WF Nov 29 Tu Last Day of Classes Dec 5 M Final Exams Dec 6 Tu Dec 12 M Final Grades Due by Noon Dec 15 Th Graduation Dec 13 Tu Dec 14 W All Dates are TENTATIVE and Subject to Change. Credit card payments can be made via Owl Express. Cash check payments can be made in Bursar s Office by 4pm. A late payment fee of 50 will be applied if payment not received by deadline. Deletion applies to entire registration if not paid by the payment deadline. For example if registered for a May Session and a 4 Week II Session all courses in all sessions are deleted for nonpayment. KSU Athletics Calendar Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "08965987-29a4-11ed-9e62-04d9f52184ba", "Title": "Visit - Kennesaw State University", "url": "https://www.kennesaw.edu/visit.php", "Body": "Visit Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Visit KSU Kennesaw State University Visit Ways to Tour Plan Your Visit Undergraduate Open House Visitor Information Welcome Future KSU Owls Kennesaw State University is passionate about supporting you from the moment you step foot onto our campuses. We want you to see and experience what Owl Life is really like. With various ways to visit our campus tours offer you a birds eye view of all the places of interest you need to know about before you decide to join the Nest. There are Various Ways to Tour KSU Visiting our campuses is a wonderful opportunity for future students families and visitors to explore the KSU culture experience the energy and learn about our Owl Nation. Both the Kennesaw and Marietta campuses are vibrant and teeming with spirit Our tours are designed to answer your questions and meet your needs so visiting Kennesaw State is a breeze. Experience KSU in Person Schedule a Campus Tour High School Group Tours Experience KSU from Home Kennesaw State Virtual Tour Interactive Maps Plan Your Visit Our Campus programs and departments have exciting and interactive events that happen year round. As you make your plans to visit Kennesaw State please check out the following to make sure your visit goes smoothly. We hope you come to love KSU as much as we do. Need Directions Kennesaw State University has two main campuses in Cobb County about 20 30 minutes north of Atlanta GA just off Interstate 75. Kennesaw Campus Kennesaw Campus 1000 Chastain RoadKennesaw GA 30144Phone 470 578 6000 Kennesaw Campus Map Marietta Campus Marietta Campus 1100 South Marietta PkwyMarietta GA 30060Phone 470 578 6000 Marietta Campus Map Don t Wait to Visit KSU Schedule a Tour today Schedule a Tour for Kennesaw Marietta Campuses Parking Campus Transportation Information We welcome all visitors to Kennesaw State year round for community events tours and more. We provide convenient parking payments through the ParkMobile app for visitors at both campuses. Additionally visit our Pay per Plate kiosks in each of our Visitor parking areas. Where to Park at KSU KSU Visitor Information Before you leave make sure you check out our award winning dining facilities and our KSU stores where you can shop for future Owl merch We also want to make sure your visit is safe and secure. Check out our Campus Safety information before planning your visit. We can t wait to see you here University Dining KSU Shopping Campus Safety Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "08ac7adc-29a4-11ed-95f2-04d9f52184ba", "Title": "Give - Kennesaw State University", "url": "https://www.kennesaw.edu/give.php", "Body": "Give Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Give to KSU Kennesaw State University Give Ways to Give Office of Development KSU Foundation Your gift to Kennesaw State University helps make a meaningful difference for generations to come. You can be a part of advancing the university's goals by making a gift to campus initiatives specific programs scholarships and or colleges. Gift opportunities are also available for cultural athletic or educational outreach programs. Donors at Kennesaw State are One of Our Greatest Assets Our continued support from friends faculty staff alumni and parents has enabled KSU to reach a greater level of excellence and attract top notch undergraduate and graduate students. Our university remains a leader in higher education thanks to the charitable gifts we receive from our generous donors. At KSU donors truly make all the difference. Ways to Give to KSU There are many ways you can invest in Kennesaw State. We support your gifting through credit cards checks money orders and electronic funds transfers. You may also invest in KSU with a bequest or life income gift. Our staff is always happy to assist you in finding the type of gift that best meets your giving needs. Give to KSU Online We accept all gifts including Online Giving Mail Recurring Credit Debit Card Draft Faculty Staff Payroll Deduction Matching Gifts Stocks and Other Securities Gift Planning Memorial Gifts Gifts in Kind Office of Development Our Office of Development at Kennesaw State is dedicated to supporting our diverse giving communities and families. We meet you where you are and make your giving goals and dreams possible with various ways to give friendly staff members to help direct your gifts and facilitate exciting donor features across the University. Where to Give Friends Family Faculty Staff Scholarships Gift Planning Visit the Office of Development See how your gift can be used for future KSU students KSU Foundation Our Kennesaw State University Foundation Inc. is a nonprofit corporation that focuses on furthering the interests of KSU by supporting guiding and protecting the university when receiving private gifts. We are committed to enhancing higher education for our faculty staff and students and increasing the quality of life on our campuses. KSU Foundation Learn more about our gift goals strategic plan and important projects Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "08f918ab-29a4-11ed-90ba-04d9f52184ba", "Title": "Current Student Information - Kennesaw State University", "url": "https://www.kennesaw.edu/current-students/", "Body": "Current Student Information Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Current Student Information Kennesaw State University Current Students D2L Brightspace KSUMail Owl Express DegreeWorks KCash Handshake My Sports Rec Owl Life Course Evaluations A Z Index Algebra Tutoring Library Dining Parking Transportation University NewsSee all news Kennesaw State faculty research among most influential in leading journal's historyKennesaw State honors student researchers in annual Birla Carbon Scholars SymposiumKennesaw State researcher receives grant to study pollution effects in birds3D Printing Ecosystem transforms education at Kennesaw State University Upcoming EventsSee all events Resources Computing Resources University Information Technology Services Service Portal Academic Resources Advising Global Education Learn Online Library Handbooks Owl Advising Registrar SMART Center Testing Center Writing Center Algebra Tutoring Athletics Recreation Esports KSU Owls Fifth Third Bank Stadium Sports Recreation Campus Services KSU Dining KSU Housing KSU Stores Events Venue Management Parking Transportation Public Safety Police Student Health Talon Card Talon One Service Center Campus Services Finances Bursar's Office Financial Aid Financial Management Tuition and Fees International Community Global Education Global Village Maya Project Latino Program Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Student Life Marching Band Club Sports Student Leadership Service African American Male Initiative Student Government Association Get Involved Owl Life Student Activities Student Media Fraternity Sorority Life Kennesaw Activities Board Student Affairs Dean of Students Office of the Dean of Students Student Advocacy Student Conduct Academic Integrity Disability Services CARE Services Health Well being Wellbeing@KSU Student Health Services Counseling Psychological Services Sports Recreation Wellness Center for Young Adult Addiction Recovery Community Leadership African American Male Initiative Diversity Inclusion Cultural Awareness Resource Center LGBTQ Resource Center Military Community Student Leadership Services Student Government Association Women's Resource Center Student Centers Carmichael Student Center Wilson Student Center Talon One Service Center Sports Entertainment Park Sustainability Biking at KSU Sustainability Need Help Get Help. With resources from academic assistance to health and emergencies these resources will allow you to get the immediate help and assistance you need at KSU. See Something Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20 30 minutes north of Atlanta GA. No matter where you choose to visit us we hope you ll love Kennesaw State University as much as we do. Academic Advising Advisors assist you in identifying and achieving your academic career and personal goals. They provide academic guidance in order to keep you on track for graduation and can help connect you to campus programs and services. You are assigned an academic advisor or advising center based on your intended major. We encourage you to meet with your advisor at least once each semester. Advising is not registration You should meet with your advisor prior to the date you register for classes so you can discuss the best plan for the upcoming semester and beyond. Academic Advising Frequently Asked Questions How do I find out who my advisor is You are assigned an advisor based on your intended major. Exploratory undecided students are seen by Owl Advising and students who have a major already identified are seen by the advisors in that department. In many cases your advisor will be viewable in DegreeWorks. How do I know when it s time to register each semester The best way to plan ahead is to access the phased registration dates on the Registrar s site. If these are not up to date you can also click on the academic calendar to view many important dates for the University including the beginning and ending of each phase of registration. The first available time for you to register can be found by logging into Owl Express. How do I change my major You can change declare your major in Owl Express under the student records tab in Owl Express. What classes are required for my major Each major has a specific list of required classes for graduation. Current KSU students should check DegreeWorks for this list. DegreeWorks is a web based tool through Banner Web that provides real time information on degree progression. DegreeWorks lists the courses you are required to take to complete your degree at KSU. This is available to you 24 7. Login to Owl Express enter your KSU ID Pin Select the Student menu. Select DegreeWorks Degree Audit. Your declared major worksheet will automatically load. There is also a WHAT IF tab that gives you an unofficial view of how your credits will apply to a different major. NOTE If you officially change your major you will be moved to the most recent Catalog regardless of when you started classes at KSU. DegreeWorks does not replace face to face advising. You should continue to meet with your advisor to discuss degree related concerns. Prospective students should contact the major department of interest for degree information. How do I find out about financial aid Information on financial aid including loans FAFSA Hope and work study opportunities can be found online at the KSU Financial Aid site. How do I find out about scholarship opportunities Your department may be aware of additional scholarships related to your field of study. In addition the KSU library contains books with information with various scholarships and grants. Is there someone I can talk to about different career options The Department of Career Planning and Development would be a great place to start. Additionally the Counseling and Psychological Services Center conducts career and academic counseling. Finally your advisors can help you see how your undergraduate major can lead you to many different careers. FIND YOUR INTEREST At KSU our colleges are dedicated to our students. Our faculty and staff are student centered and focused on providing you with a rewarding learning experience. Architecture Construction Management Arts Business Computing Software Engineering Cybersecurity Education Engineering Engineering Technology Graduate Honors Humanities Social Sciences Health Human Services Professional Education Science Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"},
{"Page_ID": "094456cc-29a4-11ed-8329-04d9f52184ba", "Title": "Faculty & Staff - Kennesaw State University", "url": "https://www.kennesaw.edu/faculty-staff/", "Body": "Faculty Staff Kennesaw State University Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business MENU Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Faculty Staff Kennesaw State University Faculty Staff D2L Brightspace KSUMail Owl Express KSU VPN OneUSG Connect KSU Connect KSU Today Banner A Z Index Coronavirus Information Directory OneUSG Connect Calendar Events University NewsSee all news Kennesaw State faculty research among most influential in leading journal's historyKennesaw State honors student researchers in annual Birla Carbon Scholars SymposiumKennesaw State researcher receives grant to study pollution effects in birds3D Printing Ecosystem transforms education at Kennesaw State University Upcoming EventsSee all events Resources Athletics Recreation Esports KSU Owls Fifth Third Bank Stadium Sports Recreation Computing Resources University Information Technology Services Service Portal Campus Services KSU Dining KSU Housing KSU Stores Events Venue Management Parking Transportation Public Safety Police Student Health Talon Card Talon One Service Center Campus Services Curriculum Instruction Assessment Catalog Double Owl Pathways Instructional Resources Curriculum Committees Communication Resources Brand Guidelines Strategic Communications and Marketing Web Accessibility Guidelines Facilities Campus Moves Project and Space Requests Maintenance Requests Facilities Services Faculty Staff Resources Academic Affairs Diverse and Inclusive Excellence Global Education Faculty Affairs Student Affairs Institutional Equity Testing Center Governance Administrators Council Chairs and Directors Assembly Faculty Senate Policy Process Council Staff Senate Student Government Association University Council Human Resources Benefits Compensation Careers at KSU Training and Development Human Resources Policies Procedures Conflict of Interest Handbooks FERPA Policy Portal Protecting Minors Records and Information Management Smoke Free Kennesaw Talent Acquisition Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Sustainability Biking at KSU Sustainability Training Development Online Learning Support Coursera Diversity Training Global Education UITS Training Services Prior Learning Assessment Health Wellbeing Wellbeing@KSU Student Health Services Counseling Psychological Services Sports Recreation Wellness Center for Young Adult Addiction Recovery Faculty Web Faculty Web Directory Give KSU Foundation Office of Development Need Help Get Help. With resources from academic assistance to health and emergencies these resources will allow you to get the immediate help and assistance you need at KSU. See Something Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20 30 minutes north of Atlanta GA. No matter where you choose to visit us we hope you ll love Kennesaw State University as much as we do. Human Resources 2022 2024 Roadmap Human Resources is part of the KSU Administration Division. We collaborate with our campus partners to provide leading HR services that attract develop and retain employees in order to deliver an exceptional campus experience where everyone can thrive. Our comprehensive plan for HR's future are rooted in our guiding principles Solution Oriented Service Collaboration Integrity and Model Positivity. We encourage you to check out our 2022 2024 Roadmap to learn more about Human Resources at Kennesaw State and our commitment to bring the very best to all KSU employees. View Download the 2022 2024 HR Roadmap Frequently Asked Questions Where can I learn more about the benefits offered to KSU employees Benefits information including details on Health Wellness Leave of Absence Worker's Comp Training Development and Retirement is located on the Human Resources website. What are employees able to do in OneUSG Connect Employees use OneUSG Connect to record and submit time access review and update personal information including direct deposit paystubs and benefits anytime anywhere by computer tablet even a smartphone. You can find out more about OneUSG Connect by visiting Human Resources' OneUSG Connect website. Where can I find out more about the Training Development opportunities offered to KSU employees KSU employee Training Development information is located on the Human Resources website. The site offers details on the latest HR Training Calendar HR OwlTrain courses as well as a list of additional resources and training opportunities. FIND YOUR INTEREST At KSU our colleges are dedicated to our students. Our faculty and staff are student centered and focused on providing you with a rewarding learning experience. Architecture Construction Management Arts Business Computing Software Engineering Cybersecurity Education Engineering Engineering Technology Graduate Honors Humanities Social Sciences Health Human Services Professional Education Science Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw GA 30144 Marietta Campus1100 South Marietta PkwyMarietta GA 30060 Campus Maps Phone470 KSU INFO 470 578 4636 kennesaw.edu info Media Resources Resources For Current Students Online Only Students Faculty Staff Parents Family Alumni Friends Community Business Related Links Libraries Housing Financial Aid Degrees Majors Programs Registrar Job Opportunities Campus Security Global Education Diverse Inclusive Excellence Sustainability Accessibility Follow KSU 470 KSU INFO 470 578 4636 2022 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Advisories Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only", "Emails": "[]"}
]